# LinePatternSegment Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternSegment Class
Members See Also
---
Represents a segment in a line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class LinePatternSegment : IDisposable
```

Visual Basic
---
```text
Public Class LinePatternSegment _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LinePatternSegment : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..LinePatternSegment
# See Also
LinePatternSegment Members
Autodesk.Revit.DB Namespace